# Element Id Constructor

Source: https://www.revitapidocs.com/2026/daf607ff-e2f0-77a2-73a5-59a7da52fa38.htm

---

| Element Id Constructor |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ElementId(BuiltInCategory) | Create an ElementId handle with the given BuiltInCategory id. |
|  | ElementId(BuiltInParameter) | Create an ElementId handle with the given BuiltInParameter id. |
|  | ElementId(Int64\) | Create an ElementId handle with the given 64\-bit integer id. |

Top See Also

#### Reference

ElementId Class Autodesk.Revit.DB Namespace